README.org
#+TITLE: Quarks System Core (QSC)
#+AUTHOR: Chatman R. Jr
#+DATE: <2021-02-23 Tue>
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:deno :results output none
#+PROPERTY: header-args:shell :results output code

* Intro :noexport:

This repository is part of a toolkit for creating, assembling, and distributing design
systems. The whole kit lives under the umbrella of the QuarkSuite name.

Other appendages of QuarkSuite include:

+ Quarks System Language (QSL): A domain-specific language for codifying design language into design systems
+ Quarks System User Interface (QSUI): A UI kit for design system documentation and visual development
+ Quarks System Development Environment (QSDE): A complete development environment integrating all
  the above and some extras

If you're interested in how this project evolved, feel free to [[https://github.com/quarksuite/legacy][browse the repository for QuarkSuite 1]].

* Summary :noexport:

The Quarks System Core is the oldest and most mature part of QuarkSuite. It's been refined from
QuarkSuite 1 to serve as an engine powering the rest of the kit.

That said, it can still be used as a standalone library if your needs are simple, you require
absolute control, or you want to develop your own design system workflow with a QSC foundation.

* Installation :noexport:
* Features :noexport:
* Source Code Index                                                   :TOC@4:
- [[#api][API]]
  - [[#how-to-read-the-api][How to Read the API]]
  - [[#utilities-utilitiesindexjs][Utilities (=utilities/index.js=)]]
    - [[#compose-utilitiescomposejs][compose (=utilities/compose.js=)]]
    - [[#pipe-utilitiespipejs][pipe (=utilities/pipe.js=)]]
    - [[#bind-utilitiesbindjs][bind (=utilities/bind.js=)]]
    - [[#tests][Tests]]
      - [[#utilities-assertions][Utilities Assertions]]
      - [[#utilities-results][Utilities Results]]
    - [[#scenarios][Scenarios]]
  - [[#color-colorindexjs][Color (=color/index.js=)]]
    - [[#format-conversion-colorconversionindexjs][Format Conversion (=color/conversion/index.js=)]]
      - [[#hex-colorconversionhexjs][hex (=color/conversion/hex.js=)]]
      - [[#rgb-colorconversionrgbjs][rgb (=color/conversion/rgb.js=)]]
      - [[#hsl-colorconversionhsljs][hsl (=color/conversion/hsl.js=)]]
      - [[#cmyk-colorconversiondevice-cmykjs][cmyk (=color/conversion/device-cmyk.js=)]]
      - [[#hwb-colorconversionhwbjs][hwb (=color/conversion/hwb.js=)]]
      - [[#lab-colorconversionlabjs][lab (=color/conversion/lab.js=)]]
      - [[#lch-colorconversionlchjs][lch (=color/conversion/lch.js=)]]
      - [[#tests-1][Tests]]
    - [[#properties-adjustment-coloradjustindexjs][Properties Adjustment (=color/adjust/index.js=)]]
      - [[#hue-coloradjusthuejs][hue (=color/adjust/hue.js=)]]
      - [[#saturation-coloradjustsaturationjs][saturation (=color/adjust/saturation.js=)]]
      - [[#lightness-coloradjustlightnessjs][lightness (=color/adjust/lightness.js=)]]
      - [[#alpha-coloradjustalphajs][alpha (=color/adjust/alpha.js=)]]
      - [[#tests-2][Tests]]
    - [[#mixing-colormixindexjs][Mixing (=color/mix/index.js=)]]
      - [[#mix][mix]]
      - [[#tests-3][Tests]]
    - [[#scheme-generation-colorschemeindexjs][Scheme Generation (=color/scheme/index.js=)]]
      - [[#complementary-colorschemecomplementaryjs][complementary (=color/scheme/complementary.js=)]]
      - [[#analogous-colorschemeanalogousjs][analogous (=color/scheme/analogous.js=)]]
      - [[#splitcomplementary-colorschemesplitjs][splitComplementary (=color/scheme/split.js=)]]
      - [[#triadic-colorschemetriadicjs][triadic (=color/scheme/triadic.js=)]]
      - [[#tetradic-colorschemetetradicjs][tetradic (=color/scheme/tetradic.js=)]]
      - [[#square-colorschemesquarejs][square (=color/scheme/square.js=)]]
      - [[#scheme-colorschemecustomjs][scheme (=color/scheme/custom.js=)]]
      - [[#tests-4][Tests]]
    - [[#palette-creation-colorpaletteindexjs][Palette Creation (=color/palette/index.js=)]]
      - [[#tints-colorpalettetintsjs][tints (=color/palette/tints.js=)]]
      - [[#tones-colorpalettetonesjs][tones (=color/palette/tones.js=)]]
      - [[#shades-colorpaletteshadesjs][shades (=color/palette/shades.js=)]]
      - [[#tests-5][Tests]]
    - [[#accessibility-colora11yindexjs][Accessibility (=color/a11y/index.js=)]]
      - [[#clrs][clrs]]
      - [[#contrast][contrast]]
      - [[#tests-6][Tests]]
  - [[#typography-typographyindexjs][Typography (=typography/index.js=)]]
    - [[#systemfonts][systemfonts]]
    - [[#tests-7][Tests]]
      - [[#typography-assertions][Typography Assertions]]
      - [[#typography-results][Typography Results]]
  - [[#modular-scale-scaleindexjs][Modular Scale (=scale/index.js=)]]
    - [[#create][create]]
    - [[#update][update]]
    - [[#merge][merge]]
    - [[#chunk][chunk]]
    - [[#units][units]]
    - [[#tests-8][Tests]]
      - [[#modular-scale-assertions][Modular Scale Assertions]]
      - [[#modular-scale-results][Modular Scale Results]]
- [[#internals][Internals]]
  - [[#error-handling-internalserrorjs][Error Handling (=internals/error.js=)]]
  - [[#color][Color]]
    - [[#formats-internalscolorformatindexjs][Formats (=internals/color/format/index.js=)]]
      - [[#rgb-hex-internalscolorformathexjs][RGB Hex (=internals/color/format/hex.js=)]]
      - [[#w3c-x11-internalscolorformatnamedjs][W3C-X11 (=internals/color/format/named.js=)]]
      - [[#functional-rgb-internalscolorformatrgbjs][Functional RGB (=internals/color/format/rgb.js=)]]
      - [[#functional-hsl-internalscolorformathsljs][Functional HSL (=internals/color/format/hsl.js=)]]
      - [[#device-cmyk-internalscolorformatdevice-cmykjs][Device CMYK (=internals/color/format/device-cmyk.js=)]]
      - [[#functional-hwb-internalscolorformathwbjs][Functional HWB (=internals/color/format/hwb.js=)]]
      - [[#functional-cie-lab-internalscolorformatlabjs][Functional CIE Lab (=internals/color/format/lab.js=)]]
      - [[#functional-cie-lch-internalscolorformatlchjs][Functional CIE LCH (=internals/color/format/lch.js=)]]
    - [[#conversion-internalscolorconvertindexjs][Conversion (=internals/color/convert/index.js=)]]
      - [[#setup-internalscolorconvertsetupjs][Setup (=internals/color/convert/setup.js=)]]
      - [[#rgb-hex-conversion-internalscolorconverthexjs][RGB Hex Conversion (=internals/color/convert/hex.js=)]]
      - [[#w3c-x11-conversion-internalscolorconvertnamedjs][W3C-X11 Conversion (=internals/color/convert/named.js=)]]
      - [[#functional-rgb-conversion-internalscolorconvertrgbjs][Functional RGB Conversion (=internals/color/convert/rgb.js=)]]
      - [[#functional-hsl-conversion-internalscolorconverthsljs][Functional HSL Conversion (=internals/color/convert/hsl.js=)]]
      - [[#device-cmyk-conversion-internalscolorconvertdevice-cmykjs][Device CMYK Conversion (=internals/color/convert/device-cmyk.js=)]]
      - [[#functional-hwb-conversion-internalscolorconverthwbjs][Functional HWB Conversion (=internals/color/convert/hwb.js=)]]
      - [[#functional-cie-lab-conversion-internalscolorconvertlabjs][Functional CIE Lab Conversion (=internals/color/convert/lab.js=)]]
      - [[#functional-cie-lch-conversion-internalscolorconvertlchjs][Functional CIE LCH Conversion (=internals/color/convert/lch.js=)]]
- [[#data][Data]]
  - [[#color-1][Color]]
    - [[#w3c-x11-color-definitions-datacolorw3c-x11js][W3C X11 Color Definitions (=data/color/w3c-x11.js=)]]
    - [[#accesible-web-defaults-datacolora11yjs][Accesible Web Defaults (=data/color/a11y.js=)]]
  - [[#typography][Typography]]
    - [[#system-font-stacks-datatypographysystemjs][System Font Stacks (=data/typography/system.js=)]]

* API

The API is organized by the kind of data each function accepts.

This means you can jump right to the section for what you need to do. The literate style isn't for
everyone, so headings are appropriately marked with their source location in the repo if you prefer
to get right into code.

** How to Read the API

Each section is broken down into:

+ functions: the actual function definitions with developer commentary
+ Tests: proving each function does its job and doesn't choke on the unexpected

** Utilities (=utilities/index.js=)

#+BEGIN_SRC deno :tangle "./utilities/index.js" :comments link
/** Functional Utilities */
export { compose } from "./compose.js";
export { pipe } from "./pipe.js";
export { bind } from "./bind.js";
#+END_SRC

The Quarks System Core rests on a functional foundation. It uses a data-last architecture and the following
utilities are designed to take full advantage of this decision.

*** compose (=utilities/compose.js=)

+ =compose: (...operators) ==> (data) ==> unknown=
+ =operators: Array<(data: unknown) ==> unknown>=: a sequence of data operators

#+BEGIN_SRC deno :tangle "./utilities/compose.js" :comments link
import { ErrorTemplate } from "../internals/error.js";

// Error handling
const isFunction = (x) => typeof x === "function";

/** Error thrown when value is not a function. */
const FuncError = (output) =>
  ErrorTemplate({
    message: "not a function",
    reason: `
This error indicates that one or more of the values is not a
function, so it can't be composed.
`,
    suggestion: `
Check that every value in your composition chain is a function.
`,
    output,
  });

/**
 * A higher order function that accepts a sequence of data operators and combines them
 * into a new function waiting for data.
 *
 * @example Splitting a string after upcasing it.
 *
 * ```ts
 *  const upper = (data) => data.toUpperCase();
 *  const split = (data) => data.split("");
 *
 *  const splitCapitalLetters = compose(upper, split);
 *
 *  splitCapitalLetters("hello"); // ["H", "E", "L", "L", "O"]
 * ```
 *
 * @remark
 * A data operator is also called a unary function. These are both ways of saying a function
 * takes a single argument.
 *
 * @param {((data: unknown) => unknown)[]} operators - a sequence of functions to combine
 * @returns {(data: unknown) => unknown} the composed function waiting for data  */
export function compose(...operators) {
  return (data) =>
    operators.reduce((value, func) => {
      if (!isFunction(func)) return FuncError(func);
      return func(value);
    }, data);
}
#+END_SRC

Two conditions must be met for compose to work:

+ all operators must be functions
+ all operations must have a signature of =(data: unknown) => unknown=

*** pipe (=utilities/pipe.js=)

+ =(data, ...operators) => unknown=
+ =data: unknown=: the data to pass through the pipeline
+ =...operators: Array<(data: unknown) => unknown>=: a sequence of data operators

#+BEGIN_SRC deno :tangle "./utilities/pipe.js" :comments link
import { compose } from "./compose.js";

/**
 * A higher order function that pipes data through a sequence of functions and
 * outputs the result.
 *
 * @example Transforming a string into an upcased array.

 * ```ts
 * const upper = (data) => data.toUpperCase();
 * const split = (data) => data.split("");
 *
 * pipe("hello", upper, split); // ["H", "E", "L", "L", "O"]
 * ```
 *
 * @remarks
 * This function simply inverts `compose` so that the data is immediately transformed
 * instead of combining the functions.
 *
 * @param {unknown} data - the data to pass through the pipeline
 * @param {((data: unknown) => unknown)[]} operators - the sequence of functions to transform data
 * @returns {unknown} The transformed data
 */
export function pipe(data, ...operators) {
  return compose(...operators)(data);
}
#+END_SRC

=pipe= inverts the relationship between data and its operators. This is crucial: data pipelines,
because of the way they're defined can /themselves/ be bound. Data, rather than being the remaining
argument, becomes the /initial/ argument and its operators can be applied freely after.

As you can see, it's a reimplementation of =compose= but with the data as the initial argument and
immediately executes on call.

*** bind (=utilities/bind.js=)

+ =(func, ...initial) => (...remaining) => unknown=
+ =func: (...args: unknown) => unknown=: the function to initialize
+ =initial: unknown[]=: the initial arguments to bind

#+BEGIN_SRC deno :tangle "./utilities/bind.js" :comments link
/**
 * A higher order function that accepts a function and some of its arguments;
 * returning a function waiting for the rest of its arguments.
 *
 * @example Binding add to add8
 *
 * ```ts
 * const add = (y, x) => x + y;
 * const add8 = bind(add, 8);
 *
 * add8(2) // 10
 * ```
 *
 * @remarks
 * `bind` is essential for converting complex utilities into preset data
 * operators which can then be `compose`d and `pipe`d.
 *
 * Additionally, you can chain bind to approximate a full curry of a function:
 * `(z, y, x) => unknown` to `(z) => (y) => (x) => unknown`
 *
 * @param {(...args: unknown[]) => unknown} func - a variadic function to initialize
 * @param {unknown[]} initial - the arguments to apply
 * @returns {((...remaining: unknown) => unknown) | unknown} A function waiing for remaining arguments or the result of calling the function if `initial = total arguments`  */
export function bind(func, ...initial) {
  return func.length === initial.length
    ? func(...initial)
    : (...remaining) => func(...initial, ...remaining);
}
#+END_SRC

Composition and data piping work out of the box for simple unary functions, but what about
functions with more than one argument?

In a data-last architecture, the final argument of a function is /always/ its data.

Any preceding arguments are *data modifiers*.

Using the =bind= utility, a function with a signature of =(z, y, x) => any= will break down to: =(z,
y) => (x) => any= or =(z) => (y) => (x) => any=.

The remaining data operation satisfies the =arity = 1= clause for composition.

*** Tests

