README.org
***** Color Format Conversion Assertions

#+BEGIN_SRC deno :tangle "./color/conversion/index_test.js" :comments link
import { cmyk, hex, hsl, hwb, lab, lch, rgb } from "./index.js";

import {
  assertEquals,
  assertThrows,
} from "https://deno.land/std@0.86.0/testing/asserts.ts";

const conversions = { hex, rgb, hsl, cmyk, hwb, lab, lch };

const samples = {
  hex: "#348ec9",
  rgb: "rgb(30, 119, 200)",
  hsl: "hsl(300, 78%, 69%)",
  cmyk: "device-cmyk(49% 2% 10% 0%)",
  hwb: "hwb(145 30% 5%)",
  lab: "lab(43.319% -42 -8)",
  lch: "lch(85.19% 73.81 67.142)",
};

const colors = [
  "midnightblue",
  "gainsboro",
  "cornsilk",
  "crimson",
  "springgreen",
  "rebeccapurple",
];

colors.forEach((color) => {
  Object.entries(conversions).forEach(([format, fn]) =>
    Deno.test(
      `SPEC try ${color} ${format.toUpperCase()}: "${fn(color)}"`,
      function () {
        assertEquals(fn(color), fn(color));
      },
    )
  );
});

Deno.test(
  `EDGE: does nothing when input is the same format as target conversion`,
  function () {
    Object.entries(conversions).forEach(([format, fn]) =>
      assertEquals(fn(samples[format]), samples[format])
    );
  },
);

Deno.test(`EDGE: rejects invalid or unsupported color formats`, function () {
  Object.values(conversions).forEach((fn) =>
    assertThrows(
      () => {
        throw fn("invalid");
      },
      undefined,
      "not a valid CSS color",
    )
  );
});
#+END_SRC

***** Color Format Conversion Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./color/conversion/index_test.js)
#+END_SRC

#+NAME: conversion-test
#+begin_src shell
running 44 tests
test SPEC try midnightblue HEX: "#191970" ... ok (5ms)
test SPEC try midnightblue RGB: "rgb(25, 25, 112)" ... ok (2ms)
test SPEC try midnightblue HSL: "hsl(240, 63.504%, 26.863%)" ... ok (2ms)
test SPEC try midnightblue CMYK: "device-cmyk(77.679% 77.679% 0% 56.078%)" ... ok (3ms)
test SPEC try midnightblue HWB: "hwb(240 9.8039% 56.078%)" ... ok (2ms)
test SPEC try midnightblue LAB: "lab(14.928% 25.96 -50.904)" ... ok (1ms)
test SPEC try midnightblue LCH: "lch(14.928% 57.141 297.021)" ... ok (2ms)
test SPEC try gainsboro HEX: "#dcdcdc" ... ok (2ms)
test SPEC try gainsboro RGB: "rgb(220, 220, 220)" ... ok (2ms)
test SPEC try gainsboro HSL: "hsl(0, 0%, 86.275%)" ... ok (2ms)
test SPEC try gainsboro CMYK: "device-cmyk(0% 0% 0% 13.726%)" ... ok (2ms)
test SPEC try gainsboro HWB: "hwb(0 86.275% 13.726%)" ... ok (2ms)
test SPEC try gainsboro LAB: "lab(87.761% 0 0)" ... ok (3ms)
test SPEC try gainsboro LCH: "lch(87.761% 0 0)" ... ok (1ms)
test SPEC try cornsilk HEX: "#fff8dc" ... ok (2ms)
test SPEC try cornsilk RGB: "rgb(255, 248, 220)" ... ok (2ms)
test SPEC try cornsilk HSL: "hsl(48, 100%, 93.137%)" ... ok (1ms)
test SPEC try cornsilk CMYK: "device-cmyk(0% 2.7451% 13.726% 0%)" ... ok (2ms)
test SPEC try cornsilk HWB: "hwb(48 86.275% 0%)" ... ok (1ms)
test SPEC try cornsilk LAB: "lab(97.584% -0.95546 14.387)" ... ok (2ms)
test SPEC try cornsilk LCH: "lch(97.584% 14.419 93.8)" ... ok (2ms)
test SPEC try crimson HEX: "#dc143c" ... ok (2ms)
test SPEC try crimson RGB: "rgb(220, 20, 60)" ... ok (2ms)
test SPEC try crimson HSL: "hsl(348, 83.333%, 47.059%)" ... ok (3ms)
test SPEC try crimson CMYK: "device-cmyk(0% 90.909% 72.727% 13.726%)" ... ok (2ms)
test SPEC try crimson HWB: "hwb(348 7.8431% 13.726%)" ... ok (2ms)
test SPEC try crimson LAB: "lab(47.88% 71.283 35.481)" ... ok (2ms)
test SPEC try crimson LCH: "lch(47.88% 79.625 26.462)" ... ok (1ms)
test SPEC try springgreen HEX: "#00ff7f" ... ok (2ms)
test SPEC try springgreen RGB: "rgb(0, 255, 127)" ... ok (1ms)
test SPEC try springgreen HSL: "hsl(150, 100%, 50%)" ... ok (2ms)
test SPEC try springgreen CMYK: "device-cmyk(100% 0% 50.196% 0%)" ... ok (2ms)
test SPEC try springgreen HWB: "hwb(150 0% 0%)" ... ok (1ms)
test SPEC try springgreen LAB: "lab(88.435% -72.513 45.975)" ... ok (2ms)
test SPEC try springgreen LCH: "lch(88.435% 85.859 147.62)" ... ok (2ms)
test SPEC try rebeccapurple HEX: "#663399" ... ok (2ms)
test SPEC try rebeccapurple RGB: "rgb(102, 51, 153)" ... ok (2ms)
test SPEC try rebeccapurple HSL: "hsl(270, 50%, 40%)" ... ok (3ms)
test SPEC try rebeccapurple CMYK: "device-cmyk(33.333% 66.667% 0% 40%)" ... ok (2ms)
test SPEC try rebeccapurple HWB: "hwb(270 20% 40%)" ... ok (3ms)
test SPEC try rebeccapurple LAB: "lab(32.393% 38.428 -47.69)" ... ok (3ms)
test SPEC try rebeccapurple LCH: "lch(32.393% 61.246 308.861)" ... ok (2ms)
test EDGE: does nothing when input is the same format as target conversion ... ok (3ms)
test EDGE: rejects invalid or unsupported color formats ... ok (4ms)

test result: ok. 44 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (97ms)

#+end_src

*** Properties Adjustment (=color/adjust/index.js=)

After ensuring that color conversion is rock solid, the possibilities for adjustment open up. The
main ways to adjust a color include:

+ Hue: the perceptual identity of a color. Hue is the way we perceive a color. The qualitative
  difference between red and cyan.
+ Saturation/Chroma: the given amount of a color. Saturation represents color /intensity/.
+ Lightness/Luminance: the amount of light a color reflects or absorbs. An indication of whether a
  a color is pure, a shade, or  a tint/pastel.
+ Alpha/Transparency: the opacity of a color. Whether a color is solid or lets light through.

Many ways exist to change these qualities, but Quarks System Core explicitly does it from the HSL(A)
color space for both ease of calculation and convention.

#+BEGIN_SRC deno :tangle "./color/adjust/index.js" :comments link
/** Color adjustment utilities */
export { h, hue } from "./hue.js";
export { s, sat, saturation } from "./saturation.js";
export { l, lightness, luminance } from "./lightness.js";
export { a, alpha, transparency } from "./alpha.js";
#+END_SRC

I also want to be able to preserve the input format of a color after adjustment so /you/ won't have to
think about it when you use these functions.

#+BEGIN_SRC deno :tangle "./color/adjust/setup.js" :comments link
import * as format from "../../internals/color/format/index.js";
import * as revert from "../conversion/index.js";

// Secondary format validation
export const preserve = (target, color) =>
  Object.values({
    hex: format.hex.validate(color) && revert.hex(target),
    named: format.named.validate(color) && revert.hex(target),
    rgb: format.rgb.validate(color) && revert.rgb(target),
    hsl: format.hsl.validate(color) && revert.hsl(target),
    cmyk: format.cmyk.validate(color) && revert.cmyk(target),
    hwb: format.hwb.validate(color) && revert.hwb(target),
    lab: format.lab.validate(color) && revert.lab(target),
    lch: format.lch.validate(color) && revert.lch(target),
  })
    .filter((matched) => !!matched)
    .toString();
#+END_SRC

The simple method performs a /secondary/ color validation for the input and passes the resulting HSL
color after adjustment along to its conversion function.

