README.org
***** Color Mixing Assertions

#+BEGIN_SRC deno :tangle "./color/mix/index_test.js" :comments link
import { mix } from "./index.js";

import {
  assertEquals,
  assertThrows,
} from "https://deno.land/std@0.86.0/testing/asserts.ts";

Deno.test("SPEC mix: can mix colors", function () {
  const red = "rgb(255, 0, 0)";
  const yellow = "rgb(255, 255, 0)";
  const green = "rgb(0, 255, 0)";
  const cyan = "rgb(0, 255, 255)";
  const blue = "rgb(0, 0, 255)";
  const magenta = "rgb(255, 0, 255)";

  const colors = [
    [red, "rgb(255, 180, 0)", yellow],
    [red, "rgb(180, 180, 0)", green],
    [red, "rgb(180, 180, 180)", cyan],
    [red, "rgb(180, 0, 180)", blue],
    [red, "rgb(255, 0, 180)", magenta],
    [yellow, "rgb(180, 255, 0)", green],
    [yellow, "rgb(180, 255, 180)", cyan],
    [yellow, "rgb(180, 180, 180)", blue],
    [yellow, "rgb(255, 180, 180)", magenta],
    [green, "rgb(0, 255, 180)", cyan],
    [green, "rgb(0, 180, 180)", blue],
    [green, "rgb(180, 180, 180)", magenta],
    [cyan, "rgb(0, 180, 255)", blue],
    [cyan, "rgb(180, 180, 255)", magenta],
    [blue, "rgb(180, 0, 255)", magenta],
  ];

  colors.forEach(([color, blend, target]) =>
    assertEquals(mix(50, target, color), blend)
  );
});

Deno.test("SPEC mix: can mix colors with alpha property", function () {
  assertEquals(mix(50, "#ce9ddaef", "#c91193"), "#cc70baf7");
  assertEquals(mix(75, "#deaded", "#face"), "#e7ace5fb");
  assertEquals(mix(95, "#3ad9cfc5", "#cc911df9"), "#49d6cac8");
});

Deno.test("SPEC mix: can mix colors of any valid format", function () {
  const colors = [
    ["#c99faa", "#ed5f66", "red"],
    ["rgb(118, 20, 250)", "rgb(216, 204, 150)", "yellow"],
    ["hsl(320, 70%, 31%)", "hsl(111, 59.514%, 51.569%)", "lime"],
    [
      "device-cmyk(0% 79% 32% 0%)",
      "device-cmyk(33.188% 9.6069% 0% 10.196%)",
      "cyan",
    ],
    ["hwb(148 28% 38%)", "hwb(222 16.863% 15.686%)", "blue"],
    ["lab(46.48% -38 120)", "lab(54.802% 64.129 -40.944)", "magenta"],
    ["lch(89.311% 63 300)", "lch(80.804% 32.723 315.73)", "#deaded"],
  ];

  colors.forEach(([color, blend, target]) =>
    assertEquals(mix(64, target, color), blend)
  );
});

Deno.test("EDGE mix: throws error when either color is invalid", function () {
  assertThrows(
    () => {
      throw mix(40, "invalid", "#c0ffee");
    },
    undefined,
    "not a valid CSS color",
  );
  assertThrows(
    () => {
      throw mix(40, "#deaded", "c0ffee");
    },
    undefined,
    "not a valid CSS color",
  );
  assertThrows(
    () => {
      throw mix(40, "invalid", "c0ffee");
    },
    undefined,
    "not a valid CSS color",
  );
});
#+END_SRC

***** Color Mixing Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./color/mix/index_test.js)
#+END_SRC

#+NAME: mix-test
#+begin_src shell
running 4 tests
test SPEC mix: can mix colors ... ok (17ms)
test SPEC mix: can mix colors with alpha property ... ok (4ms)
test SPEC mix: can mix colors of any valid format ... ok (11ms)
test EDGE mix: throws error when either color is invalid ... ok (3ms)

test result: ok. 4 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (36ms)

#+end_src

*** Scheme Generation (=color/scheme/index.js=)

Color schemes are a way of adding more visual interest and tension to a design. The primary scheme
configurations used in digital design include:

+ Monochromatic: a single color scheme consisting of a base color and palette variants (tints,
  tones, and/or shades) of that color
+ Analogous: a multi-color scheme consisting of a base color and a selection of hues directly next
  to it on the color wheel. Examples: red, orange, yellow or red, magenta-red, magenta
+ Complementary: a two color scheme consisting of a base color and its complement (opposite) on the
  color wheel. Examples: red and cyan or green and magenta
+ Split-Complementary: A three color scheme consisting of a base color and two hues on either side
  of its complement. Example: red, cyan-blue, green-cyan
+ Triadic: a color scheme consisting of three colors equally spaced around the color wheel. Example:
  red, green, blue
+ Tetradic/Dual: a four color scheme consisting of a base color, its complement, and a rotational
  offset of both points; creating a rectangle
+ Square: a color scheme consisting of four colors equally spaced around the color wheel

Besides providing functions for each of the basic color schemes, Quarks System Core also provides
a function for generating advanced custom schemes.

#+BEGIN_SRC deno :tangle "./color/scheme/index.js" :comments link
export { complementary } from "./complementary.js";
export { analogous } from "./analogous.js";
export { splitComplementary } from "./split.js";
export { triadic } from "./triadic.js";
export { tetradic, dualComplementary } from "./tetradic.js";
export { square } from "./square.js";
export { scheme } from "./custom.js";
#+END_SRC

Compared with QuarkSuite 1, QSC eliminates scheme boilerplate and leaves calculation and offset
adjustments for the advanced function.

**** complementary (=color/scheme/complementary.js=)

+ =complementary: (color: string) => [string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC deno :tangle "./color/scheme/complementary.js" :comments link
import { hue } from "../adjust/hue.js";

/**
 * Creates a complementary color scheme from any valid CSS color.
 *
 * @example Creating a complementary scheme
 *
 * ```ts
 * complementary("coral");
 * ```
 *
 * @remarks
 * A complementary color scheme is composed of a base color and its
 * opposite on the color wheel. It is a scheme with the highest possible
 * warm/cool color contrast.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string]} The base hues for a complementary color scheme
 */
export const complementary = (color) => [hue(0, color), hue(180, color)];
#+END_SRC

**** analogous (=color/scheme/analogous.js=)

+ =analogous: (color: string) => [string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC deno :tangle "./color/scheme/analogous.js" :comments link
import { hue } from "../adjust/hue.js";

const construct = (arc, color) => [
  hue(0, color),
  hue(-arc, color),
  hue(arc, color),
];

/**
 * Creates an analogous color scheme from any valid CSS color.
 *
 * @example Creating an analogous color scheme
 *
 * ```ts
 * analogous("coral");
 * ```
 *
 * @remarks
 * An analogous color scheme is composed of a color and its directly
 * adjacent counterparts on the color wheel; hues about 30° apart from
 * the origin.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string]} The base hues for a analogous color scheme
 */
export const analogous = (color) => construct(30, color);
#+END_SRC

**** splitComplementary (=color/scheme/split.js=)

+ =splitComplementary: (color: string) => [string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC deno :tangle "./color/scheme/split.js" :comments link
import { hue } from "../adjust/hue.js";

export function construct(arc, color) {
  const complement = hue.bind(null, 180);

  return [
    hue(0, color),
    hue(arc, complement(color)),
    hue(-arc, complement(color)),
  ];
}

/**
 * Creates a split complementary color scheme from any valid CSS color.
 *
 * @example Creaing a split complementary scheme
 *
 * ```ts
 * splitComplementary("coral");
 * ```
 *
 * @remarks
 * A split complementary scheme is composed of a base color and a bisection
 * of colors directly next to its opposite; hues about 30° apart.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string]} The base hues for a split complementary color scheme
 */
export const splitComplementary = (color) => construct(30, color);
#+END_SRC

**** triadic (=color/scheme/triadic.js=)

+ =triadic: (color: string) => [string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC deno :tangle "./color/scheme/triadic.js" :comments link
import { hue } from "../adjust/hue.js";
import { construct } from "./split.js";

/**
 * Creates a triadic color scheme from any valid CSS color.
 *
 * @example Creating a triadic color scheme
 *
 * ```ts
 * triadic("coral");
 * ```
 *
 * @remarks
 * A triadic color scheme is composed of three colors evenly spaced around
 * the color wheel; the origin and two hues 120° apart from the origin.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string]} The base hues for a triadic color scheme
 */
export const triadic = (color) => construct(60, color);
#+END_SRC

