README.org
**** tetradic (=color/scheme/tetradic.js=)

+ =tetradic/dualComplementary: (color: string) => [string, string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC deno :tangle "./color/scheme/tetradic.js" :comments link
import { hue } from "../adjust/hue.js";

export function construct(offset, color) {
  const origin = hue(0, color);
  const complement = hue(180, color);

  return [origin, hue(-offset, origin), complement, hue(-offset, complement)];
}

/**
 * Creates a tetradic color scheme from any valid CSS color.
 *
 * @example Creating a tetradic color scheme
 *
 * ```ts
 * tetradic("coral");
 * ```
 *
 * @remarks
 * A tetradic color scheme consists of a color, its opposite, and a
 * second complementary pair of colors. They are also called dual
 * complementary schemes.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string, string]} The base hues for a tetradic color scheme
 */
export const tetradic = (color) => construct(60, color);

/** An alias for `tetradic()` */
export const dualComplementary = tetradic;
#+END_SRC

**** square (=color/scheme/square.js=)

+ =square: (color: string) => [string, string, string, string]=
+ =color: string=: the base color to generate from

#+BEGIN_SRC deno :tangle "./color/scheme/square.js" :comments link
import { hue } from "../adjust/hue.js";
import { construct } from "./tetradic.js";

/**
 * Creates a square color scheme from any valid CSS color.
 *
 * @example Creating a square color scheme
 *
 * ```ts
 * square("coral");
 * ```
 *
 * @remarks
 * A square color scheme consists of four colors positioned equally
 * around the color wheel; hues 90° apart from the origin.
 *
 * @param {string} color - the base color to generate from
 * @returns {[string, string, string, string]} The base hues for a square color scheme
 */
export const square = (color) => construct(90, color);
#+END_SRC

**** scheme (=color/scheme/custom.js=)

+ =scheme: (attrs: { hues: number, arc: number, offset?: number }, color: string) => string[]=
+ =attrs: { hues: number, arc: number, offset?: number }=
  - =hues: number=: the number of total hues to generate (minus values that overlap)
  - =arc: number=: the desired arc distance between each hue on the wheel
  - =offset?: number=: an optional rotation offset for generated hues (does not change origin)
+ =color: string=: the base color to generate custom scheme

#+BEGIN_SRC deno :tangle "./color/scheme/custom.js" :comments link
import { hue } from "../adjust/hue.js";

function generate({ hues, arc, offset = 0 }, color) {
  const values = Array(offset ? hues - 1 : hues + 1).fill(arc);
  const half = Math.ceil(values.length / 2);
  const [leftOfOrigin, rightOfOrigin] = [
    values.slice(0, half),
    values.slice(half, values.length),
  ];
  return offset
    ? [
      ...new Set([
        hue(0, color),
        ...leftOfOrigin.map((v, i) => hue(-(v * i) - offset, color)),
        ...rightOfOrigin.map((v, i) => hue(v * i + offset, color)),
      ]),
    ] // Must preserve the origin with offset
    : [
      ...new Set([
        ...leftOfOrigin.map((v, i) => hue(-(v * i) - offset, color)),
        ...rightOfOrigin.map((v, i) => hue(v * i + offset, color)),
      ]),
    ]; // Must add an extra hue to generate from origin
}

/**
 * A function for creating advanced schemes from any valid CSS color.
 *
 * @example Creating a five tone color scheme
 *
 * ```ts
 * scheme({ hues: 5, arc: 72 }, "#e33a00");
 * ```
 *
 * @example Creating a six tone color scheme
 *
 * ```ts
 * scheme({ hues: 6, arc: 60 }, "hsl(320grad, 75%, 50%)");
 * ```
 * @example  Creating an accented split complementary
 *
 * ```ts
 * scheme({ hues: 4, arc: 30, offset: 150 }, "royalblue");
 * ```
 *
 * @remarks
 * This function is for generating schemes beyond basic configuration.
 *
 * It allows setting any number of hues but will only generate unique colors.
 * The arc is the distance between each color on the wheel. The offset defines
 * degree of rotation for the generated hues from the origin.
 *
 * @param {{ hues: number, arc: number, offset?: number }} attrs - A configuration object defining desired hues (minus overlapping values), arc distance between each hue from the origin, and optional rotation offset
 * @param {string} color - the base color to generate scheme
 * @returns {string[]} A collection of base hues for a custom scheme
 */
export const scheme = (attrs, color) => generate(attrs, color);
#+END_SRC

**** Tests

***** Color Scheme Generation Assertions

#+BEGIN_SRC deno :tangle "./color/scheme/index_test.js" :comments link
import {
  analogous,
  complementary,
  dualComplementary,
  scheme,
  splitComplementary,
  square,
  tetradic,
  triadic,
} from "./index.js";

import {
  assertEquals,
  assertThrows,
} from "https://deno.land/std@0.86.0/testing/asserts.ts";

Deno.test(
  "SPEC complementary: generate base hues for complementary scheme",
  function () {
    assertEquals(complementary("red"), ["#ff0000", "#00ffff"]);
    assertEquals(complementary("lime"), ["#00ff00", "#ff00ff"]);
    assertEquals(complementary("blue"), ["#0000ff", "#ffff00"]);
  },
);

Deno.test(
  "SPEC analogous: generate base hues for analogous scheme",
  function () {
    assertEquals(analogous("red"), ["#ff0000", "#ff0080", "#ff8000"]);
    assertEquals(analogous("lime"), ["#00ff00", "#80ff00", "#00ff80"]);
    assertEquals(analogous("blue"), ["#0000ff", "#0080ff", "#8000ff"]);
  },
);

Deno.test(
  "SPEC splitComplementary: generate base hues for split complementary scheme",
  function () {
    assertEquals(splitComplementary("red"), ["#ff0000", "#0080ff", "#00ff80"]);
    assertEquals(splitComplementary("lime"), ["#00ff00", "#ff0080", "#8000ff"]);
    assertEquals(splitComplementary("blue"), ["#0000ff", "#80ff00", "#ff8000"]);
  },
);

Deno.test("SPEC triadic: generate base hues for triadic scheme", function () {
  assertEquals(triadic("red"), ["#ff0000", "#0000ff", "#00ff00"]);
  assertEquals(triadic("cyan"), ["#00ffff", "#ffff00", "#ff00ff"]);
});

Deno.test("SPEC tetradic: generate base hues for tetradic scheme", function () {
  assertEquals(tetradic("red"), ["#ff0000", "#ff00ff", "#00ffff", "#00ff00"]);
  assertEquals(tetradic("lime"), ["#00ff00", "#ffff00", "#ff00ff", "#0000ff"]);
  assertEquals(tetradic("blue"), ["#0000ff", "#00ffff", "#ffff00", "#ff0000"]);
});

Deno.test("ALIAS dualComplementary of tetradic", function () {
  assertEquals(dualComplementary("cyan"), [
    "#00ffff",
    "#00ff00",
    "#ff0000",
    "#ff00ff",
  ]);
});

Deno.test("SPEC square: generate base hues for square scheme", function () {
  assertEquals(square("red"), ["#ff0000", "#8000ff", "#00ffff", "#80ff00"]);
  assertEquals(square("lime"), ["#00ff00", "#ff8000", "#ff00ff", "#0080ff"]);
  assertEquals(square("blue"), ["#0000ff", "#00ff80", "#ffff00", "#ff0080"]);
});

Deno.test("SPEC scheme: simulate complementary", function () {
  assertEquals(scheme({ hues: 2, arc: 180 }, "red"), ["#ff0000", "#00ffff"]);
});

Deno.test("SPEC scheme: simulate triadic", function () {
  assertEquals(scheme({ hues: 3, arc: 120 }, "red"), [
    "#ff0000",
    "#0000ff",
    "#00ff00",
  ]);
});

Deno.test("SPEC scheme: simulate square", function () {
  assertEquals(scheme({ hues: 4, arc: 90 }, "red"), [
    "#ff0000",
    "#8000ff",
    "#00ffff",
    "#80ff00",
  ]);
});

Deno.test("SPEC scheme: 4 color analogous", function () {
  assertEquals(scheme({ hues: 4, arc: 30 }, "red"), [
    "#ff0000",
    "#ff0080",
    "#ff00ff",
    "#ff8000",
  ]);
});

Deno.test("SPEC scheme: accented triad", function () {
  assertEquals(scheme({ hues: 5, arc: 30, offset: 120 }, "red"), [
    "#ff0000",
    "#0000ff",
    "#0080ff",
    "#00ff00",
    "#00ff80",
  ]);
});

Deno.test("SPEC scheme: accented split complementary", function () {
  assertEquals(scheme({ hues: 4, arc: 30, offset: 150 }, "red"), [
    "#ff0000",
    "#0080ff",
    "#00ffff",
    "#00ff80",
  ]);
});

Deno.test("EDGE: rejects invalid color", function () {
  const fns = [
    complementary,
    analogous,
    splitComplementary,
    triadic,
    tetradic,
    square,
  ];

  fns.map((fn) =>
    assertThrows(
      () => {
        throw fn("invalid");
      },
      undefined,
      "not a valid CSS color",
    )
  );
  assertThrows(
    () => {
      throw scheme({ hues: 2, arc: 180 }, "invalid");
    },
    undefined,
    "not a valid CSS color",
  );
});
#+END_SRC

***** Color Scheme Generation Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./color/scheme/index_test.js)
#+END_SRC

#+NAME: scheme-test
#+begin_src shell
running 14 tests
test SPEC complementary: generate base hues for complementary scheme ... ok (17ms)
test SPEC analogous: generate base hues for analogous scheme ... ok (6ms)
test SPEC splitComplementary: generate base hues for split complementary scheme ... ok (8ms)
test SPEC triadic: generate base hues for triadic scheme ... ok (5ms)
test SPEC tetradic: generate base hues for tetradic scheme ... ok (5ms)
test ALIAS dualComplementary of tetradic ... ok (3ms)
test SPEC square: generate base hues for square scheme ... ok (3ms)
test SPEC scheme: simulate complementary ... ok (1ms)
test SPEC scheme: simulate triadic ... ok (3ms)
test SPEC scheme: simulate square ... ok (3ms)
test SPEC scheme: 4 color analogous ... ok (3ms)
test SPEC scheme: accented triad ... ok (3ms)
test SPEC scheme: accented split complementary ... ok (3ms)
test EDGE: rejects invalid color ... ok (3ms)

test result: ok. 14 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (70ms)

#+end_src

*** Palette Creation (=color/palette/index.js=)

A color palette isn't complete without contrast, so we'll finish with tints, tones, and shades.

+ Tints: any color mixed with pure white
+ Tones: any color mixed with pure gray
+ Shades: any color mixed with pure black

#+BEGIN_SRC deno :tangle "./color/palette/index.js" :comments link
export { tints } from "./tints.js";
export { tones } from "./tones.js";
export { shades } from "./shades.js";
#+END_SRC

First, I'm setting up a helper for generating my variants.

#+BEGIN_SRC deno :tangle "./color/palette/setup.js" :comments link
import { mix } from "../mix/index.js";

export const generate = (color, target, contrast, count) =>
  Array.from(Array(count).fill(color)).map((base, index) =>
    mix(contrast - (contrast / count) * index, target, base)
  );
#+END_SRC

