README.org
**** tints (=color/palette/tints.js=)

+ =tints: (count: number, contrast: number, color: string) => string[]=
+ =count: number=: number of tints to generate
+ =contrast: number=: contrast between generated values (as a percentage)
+ =color: string=: the base color to generate tints from

#+BEGIN_SRC deno :tangle "./color/palette/tints.js" :comments link
import { pipe } from "../../utilities/pipe.js";
import { generate } from "./setup.js";
import { extract } from "../../internals/color/format/hwb.js";
import { hwb } from "../conversion/hwb.js";
import { preserve } from "../adjust/setup.js";

/**
 * Generates tints from any valid CSS color.
 *
 * @example Generating 4 high contrast tints
 *
 * ```ts
 * tints(4, 98, "royalblue");
 * ```
 *
 * @remarks
 * A color mixed with pure white creates a tint of that color.
 *
 * @param {number} count - number of tints to generate
 * @param {number} contrast - contrast of palette (as a percentage)
 * @param {string} color - the base color to generate from
 * @returns {string[]} A generated scale of tints
 */
export const tints = (
  count,
  contrast,
  color,
) => [
  ...new Set([
    ...generate(color, "white", contrast, count)
      .map((color) => pipe(color, hwb, extract))
      .sort((a, b) => parseFloat(a[1]) - parseFloat(b[1]))
      .map(([H, W, B, A]) =>
        !A ? `hwb(${H} ${W} ${B})` : `hwb(${H} ${W} ${B} / ${A})`
      )
      .map((target) => preserve(target, color)),
  ]),
];
#+END_SRC

**** tones (=color/palette/tones.js=)

+ =tones: (count: number, contrast: number, color: string) => string[]=
+ =count: number=: number of tones to generate
+ =contrast: number=: contrast between generated values (as a percentage)
+ =color: string=: the base color to generate tones from

#+BEGIN_SRC deno :tangle "./color/palette/tones.js" :comments link
import { pipe } from "../../utilities/pipe.js";
import { generate } from "./setup.js";
import { extract } from "../../internals/color/format/hwb.js";
import { hwb } from "../conversion/hwb.js";
import { preserve } from "../adjust/setup.js";

/**
 * Generates tones from any valid CSS color.
 *
 * @example Generating 4 high contrast tones
 *
 * ```ts
 * tones(4, 98, "royalblue");
 * ```
 *
 * @remarks
 * A color mixed with pure gray creates a tone of that color.
 *
 * Be aware that tone is also another way of referring to the hue.
 *
 * @param {number} count - number of tones to generate
 * @param {number} contrast - contrast of palette (as a percentage)
 * @param {string} color - the base color to generate from
 * @returns {string[]} A generated scale of tones
 */
export const tones = (
  count,
  contrast,
  color,
) => [
  ...new Set([
    ...generate(color, "gray", contrast, count)
      .map((color) => pipe(color, hwb, extract))
      .sort(
        (a, b) =>
          parseFloat(a[1]) +
          parseFloat(a[2]) -
          (parseFloat(b[1]) + parseFloat(b[2])),
      )
      .map(([H, W, B, A]) =>
        !A ? `hwb(${H} ${W} ${B})` : `hwb(${H} ${W} ${B} / ${A})`
      )
      .map((target) => preserve(target, color)),
  ]),
];
#+END_SRC

**** shades (=color/palette/shades.js=)

+ =shades: (count: number, contrast: number, color: string) => string[]=
+ =count: number=: number of shades to generate
+ =contrast: number=: contrast between generated values (as a percentage)
+ =color: string=: the base color to generate shades from

#+BEGIN_SRC deno :tangle "./color/palette/shades.js" :comments link
import { pipe } from "../../utilities/pipe.js";
import { generate } from "./setup.js";
import { extract } from "../../internals/color/format/hwb.js";
import { hwb } from "../conversion/hwb.js";
import { preserve } from "../adjust/setup.js";

/**
 * Generates shades from any valid CSS color.
 *
 * @example Generating 4 high contrast shades
 *
 * ```ts
 * shades(4, 98, "royalblue");
 * ```
 *
 * @remarks
 * A color mixed with pure black creates a shade of that color.
 *
 * @param {number} count - number of shades to generate
 * @param {number} contrast - contrast of palette (as a percentage)
 * @param {string} color - the base color to generate from
 * @returns {string[]} A generated scale of shades
 */
export const shades = (
  count,
  contrast,
  color,
) => [
  ...new Set([
    ...generate(color, "black", contrast, count)
      .map((color) => pipe(color, hwb, extract))
      .sort((a, b) => parseFloat(a[2]) - parseFloat(b[2]))
      .map(([H, W, B, A]) =>
        !A ? `hwb(${H} ${W} ${B})` : `hwb(${H} ${W} ${B} / ${A})`
      )
      .map((target) => preserve(target, color)),
  ]),
];
#+END_SRC

**** Tests

***** Color Palette Assertions

#+BEGIN_SRC deno :tangle "./color/palette/index_test.js" :comments link
import { shades, tints, tones } from "./index.js";

import {
  assertEquals,
  assertThrows,
} from "https://deno.land/std@0.86.0/testing/asserts.ts";

Deno.test("SPEC tints: can generate tints", function () {
  assertEquals(tints(2, 100, "red"), ["#ffb4b4", "#ffffff"]);
  assertEquals(tints(3, 100, "lime"), ["#92ff92", "#d1ffd1", "#ffffff"]);
  assertEquals(tints(4, 100, "blue"), [
    "#8080ff",
    "#b4b4ff",
    "#ddddff",
    "#ffffff",
  ]);
});

Deno.test("SPEC tones: can generate tones", function () {
  assertEquals(tones(2, 100, "red"), ["#ca5b5b", "#808080"]);
  assertEquals(tones(3, 100, "lime"), ["#4add4a", "#69b469", "#808080"]);
  assertEquals(tones(4, 100, "blue"), [
    "#4040e6",
    "#5b5bca",
    "#6f6fa9",
    "#808080",
  ]);
});

Deno.test("SPEC shades: can generate shades", function () {
  assertEquals(shades(2, 100, "red"), ["#b40000", "#000000"]);
  assertEquals(shades(3, 100, "lime"), ["#00d100", "#009200", "#000000"]);
  assertEquals(shades(4, 100, "blue"), [
    "#0000dd",
    "#0000b4",
    "#000080",
    "#000000",
  ]);
});
#+END_SRC

***** Color Palette Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./color/palette/index_test.js)
#+END_SRC

#+NAME: palette-test
#+begin_src shell
running 3 tests
test SPEC tints: can generate tints ... ok (46ms)
test SPEC tones: can generate tones ... ok (10ms)
test SPEC shades: can generate shades ... ok (9ms)

test result: ok. 3 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (67ms)

#+end_src

*** Accessibility (=color/a11y/index.js=)

Accessibility is a first-class concern for every modern web project. Quarks System Core
addresses this vital aspect of digital design with the following tools.

**** clrs

+ =clrs: (color: string) => string=
+ =color: string=: a valid name for a swatch in the Colors project

#+BEGIN_SRC deno :tangle "./color/a11y/index.js" :comments link
import { ErrorTemplate } from "../../internals/error.js";
import { A11yColors } from "../../data/color/a11y.js";

const ColorUndefinedError = (output) =>
  ErrorTemplate({
    message: "color not defined in Colors",
    reason: `
This error triggers when the color does not match a defined color in
the Colors project.
`,
    suggestion: `
Pass in one of the below valid colors:

navy
blue
aqua

teal

olive
green
lime

yellow
orange
red

maroon
fuchsia
purple

black

gray/grey
silver

white
`,
    output,
  });

/**
 * A function for using better web defaults from the Colors project.
 *
 * @example Using a more accessible teal
 *
 * ```ts
 * clrs("teal");
 * ```
 *
 * @param { "navy" | "aqua" | "blue" | "teal" | "olive" | "green" | "lime" | "yellow" | "orange" | "red" | "maroon" | "fuchsia" | "purple" | "black" | "gray" | "grey" | "silver" | "white" } color - a valid color name in the Colors project
 * @returns {string} The targeted color from the Colors project
 */
export function clrs(color) {
  if (A11yColors.hasOwnProperty(color)) {
    return A11yColors[color];
  }

  return ColorUndefinedError(color);
}
#+END_SRC

A great base for accessible palettes is the Colors project. It provides a [[https://clrs.cc][curated collection of
better default colors]] optimized for high contrast interfaces.

