README.org
**** contrast

+ =contrast: (opts: { rating: "AA" | "AAA", enhanced?: boolean }, palette: string[]) => string[]=
+ =opts: { rating: "AA" | "AAA", enhanced?: boolean }=: palette contrast filtering options
  - =rating: "AA" | "AAA"=: the desired minimum WCAG color contrast accessibility rating to process a palette
  - =enhanced?: boolean=: a flag to toggle the enhanced WCAG recommendations

QSC allows a hefty degree of flexibility in defining and generating your palettes. It also provides
a necessary guardrail to keep color choices from running afoul of usability.

#+BEGIN_SRC deno :tangle "./color/a11y/index.js" :comments link
import { significant } from "../../internals/color/convert/setup.js";
import { calcFractionFromChannel } from "../../internals/color/convert/setup.js";
import { extract } from "../../internals/color/format/rgb.js";
import { pipe } from "../../utilities/pipe.js";
import { rgb } from "../conversion/rgb.js";

const precision = significant.bind(null, 3);

function calcRelativeLuminance(color) {
  const [R, G, B] = pipe(color, rgb, extract)
    .map((V) =>
      pipe(
        V,
        parseFloat,
        calcFractionFromChannel,
      )
    ).map((V) => V <= 0.03928 ? V / 12.92 : ((V + 0.055) / 1.055) ** 2.4);

  return R * 0.2126 + 0.7152 * G + B * 0.0722;
}

function calcRatio(foreground, background) {
  const [L1, L2] = [foreground, background].sort((a, b) =>
    calcRelativeLuminance(b) - calcRelativeLuminance(a)
  ).map((V) => calcRelativeLuminance(V));

  return precision((L1 + 0.05) / (L2 + 0.05));
}

/**
 * A function that allows you to filter palettes by their contrast rating.
 *
 * @example Filtering a palette to only contain colors with a WCAG AA rating
 *
 * ```ts
 * contrast({ rating: "AA" }, palette);
 * ```
 *
 * @example Filtering a palette to only contain colors with a WCAG AAA rating
 *
 * ```ts
 * contrast({ rating: "AAA" }, palette);
 * ```
 *
 * @example Using the enhanced recommendations flag
 *
 * ```ts
 * contrast({ rating: "AA", enhanced: true}, palette);
 * ```
 *
 * @param {{ rating: "AA" | "AAA", enhanced?: boolean }} opts - options for filtering the palette
 * @param {string[]} palette - the completed color palette to filter
 * @returns {string[]} A color palette filtered by accessibility standards
 */
export function contrast(opts, palette) {
  const { rating, enhanced = false } = opts;
  const [base, ...generated] = palette;

  return [
    base,
    ...generated.filter((color) => {
      const ratio = calcRatio(base, color);
      const max = ratio <= 21;

      if (rating === "AA") {
        return (enhanced ? (ratio >= 4.5) : (ratio >= 3.1)) && max;
      }

      if (rating === "AAA") {
        return (enhanced ? (ratio >= 7) : (ratio >= 4.5)) && max;
      }
    }),
  ];
}
#+END_SRC

You can use the =contrast()= function in two main ways:

+ Validating your color choices for a custom palette
+ Filtering a generated palette down to an accessible subset of colors

**** Tests

***** Color Accessibility Assertions

#+BEGIN_SRC deno :tangle "./color/a11y/index_test.js" :comments link
import { clrs, contrast } from "./index.js";
import { shades, tints } from "../palette/index.js";

import {
  assertEquals,
  assertThrows,
} from "https://deno.land/std@0.86.0/testing/asserts.ts";

const Colors = [
  ["navy", "#001f3f"],
  ["blue", "#0074d9"],
  ["aqua", "#7fdbff"],
  ["teal", "#39cccc"],
  ["olive", "#3d9970"],
  ["green", "#2ecc40"],
  ["lime", "#01ff70"],
  ["yellow", "#ffdc00"],
  ["orange", "#ff851b"],
  ["red", "#ff4136"],
  ["maroon", "#85144b"],
  ["fuchsia", "#f012be"],
  ["purple", "#b10dc9"],
  ["black", "#111111"],
  ["gray", "#aaaaaa"],
  ["grey", "#aaaaaa"],
  ["silver", "#dddddd"],
  ["white", "#ffffff"],
];

Colors.forEach(([name, value]) =>
  Deno.test(`SPEC clrs: ${value} matches ${name}`, function () {
    assertEquals(clrs(name), value);
  })
);

Deno.test("EDGE clrs: rejects undefined color", function () {
  assertThrows(
    () => {
      throw clrs("invalid");
    },
    undefined,
    "color not defined in Colors",
  );
});

Deno.test("SPEC contrast: can generate WCAG AA compliant results", function () {
  const base = clrs("red");
  const palette = [base, ...tints(16, 99, base), ...shades(16, 99, base)];

  assertEquals(contrast({ rating: "AA" }, palette), [
    "#ff4136",
    "#ffefef",
    "#fff7f6",
    "#fffefe",
    "#721d18",
    "#5c1713",
    "#43110e",
    "#1a0705",
  ]);
});

Deno.test("SPEC contrast: can generate WCAG AAA compliant results", function () {
  const base = clrs("lime");
  const palette = [base, ...tints(32, 99, base), ...shades(32, 99, base)];

  assertEquals(contrast({ rating: "AAA" }, palette), [
    "#01ff70",
    "#007232",
    "#00662c",
    "#005c28",
    "#005123",
    "#00431e",
    "#003316",
    "#001a0b",
  ]);
});

Deno.test("SPEC contrast: can generate WCAG AA (enhanced) compliant results", function () {
  const base = clrs("aqua");
  const palette = [base, ...tints(32, 99, base), ...shades(32, 99, base)];

  assertEquals(contrast({ rating: "AA", enhanced: true }, palette), [
    "#7fdbff",
    "#335866",
    "#2e4f5c",
    "#284551",
    "#223a43",
    "#192c33",
    "#0d161a",
  ]);
});

Deno.test("SPEC contrast: can generate WCAG AAA (enhanced) compliant results", function () {
  const base = clrs("silver");
  const palette = [base, ...tints(32, 99, base), ...shades(32, 99, base)];

  assertEquals(contrast({ rating: "AAA", enhanced: true }, palette), [
    "#dddddd",
    "#3a3a3a",
    "#2c2c2c",
    "#161616",
  ]);
});
#+END_SRC

***** Color Accessibility Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./color/a11y/index_test.js)
#+END_SRC

#+NAME: accessibility-test
#+begin_src shell
running 23 tests
test SPEC clrs: #001f3f matches navy ... ok (5ms)
test SPEC clrs: #0074d9 matches blue ... ok (2ms)
test SPEC clrs: #7fdbff matches aqua ... ok (2ms)
test SPEC clrs: #39cccc matches teal ... ok (2ms)
test SPEC clrs: #3d9970 matches olive ... ok (2ms)
test SPEC clrs: #2ecc40 matches green ... ok (2ms)
test SPEC clrs: #01ff70 matches lime ... ok (2ms)
test SPEC clrs: #ffdc00 matches yellow ... ok (2ms)
test SPEC clrs: #ff851b matches orange ... ok (2ms)
test SPEC clrs: #ff4136 matches red ... ok (2ms)
test SPEC clrs: #85144b matches maroon ... ok (1ms)
test SPEC clrs: #f012be matches fuchsia ... ok (2ms)
test SPEC clrs: #b10dc9 matches purple ... ok (2ms)
test SPEC clrs: #111111 matches black ... ok (2ms)
test SPEC clrs: #aaaaaa matches gray ... ok (2ms)
test SPEC clrs: #aaaaaa matches grey ... ok (2ms)
test SPEC clrs: #dddddd matches silver ... ok (2ms)
test SPEC clrs: #ffffff matches white ... ok (2ms)
test EDGE clrs: rejects undefined color ... ok (3ms)
test SPEC contrast: can generate WCAG AA compliant results ... ok (56ms)
test SPEC contrast: can generate WCAG AAA compliant results ... ok (65ms)
test SPEC contrast: can generate WCAG AA (enhanced) compliant results ... ok (63ms)
test SPEC contrast: can generate WCAG AAA (enhanced) compliant results ... ok (64ms)

test result: ok. 23 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (290ms)

#+end_src

** Typography (=typography/index.js=)

Quarks System Core isn't focused much on typography at this point, but it does provide a single
function =systemfonts()= to aid [[https://systemfontstack.com][prototyping with system font stacks]]. I'll expand this module as
needed in step with the project's growth.

*** systemfonts

+ =systemfonts: (...families: ("san-serif" | "serif" | "monospace")[]) => string[]=
+ =...families: ("sans-serif" | "serif" | "monospace")[]=: keywords matching the available system font
  stacks

#+BEGIN_SRC deno :tangle "./typography/index.js" :comments link
import { SystemFontStacks } from "../data/typography/system.js";
import { ErrorTemplate } from "../internals/error.js";

const SystemFamilyError = (output) =>
  ErrorTemplate({
    message: "key is not a system font stack family",
    reason: `
This error is triggered when one or more of the keys passed into
systemfonts() is invalid.
`,
    suggestion: `
Pass in valid system font stack keywords as strings.

Examples:

systemfonts("sans-serif", "monospace");
systemfonts("sans-serif", "serif");
systemfonts("sans-serif");
systemfonts("sans-serif", "serif", "monospace");
`,
    output,
  });

/**
 * Outputs a collection of system font stacks.
 *
 * @example Outputting a single family
 *
 * ```ts
 * systemfonts("sans-serif");
 * ```
 *
 * @example Outputting multiple families
 *
 * ```ts
 * systemfonts("sans-serif", "serif");
 * ```
 *
 * @example Outputting all families
 *
 * ```ts
 * systemfonts("sans-serif", "serif", "monospace");
 * ```
 *
 * @param {("sans-serif" | "serif" | "monospace")[]} families - keyword(s) matching available system font stacks
 * @returns {string[]} An array of system font stacks
 */
export function systemfonts(...families) {
  if (
    families.every((family) =>
      family === "sans-serif" || family === "serif" || family === "monospace"
    )
  ) {
    return families.map((family) => SystemFontStacks[family]);
  }

  return SystemFamilyError(families);
}
#+END_SRC

*** Tests

**** Typography Assertions

#+BEGIN_SRC deno :tangle "./typography/index_test.js" :comments link
import { systemfonts } from "./index.js";

import {
  assertEquals,
  assertThrows,
} from "https://deno.land/std@0.86.0/testing/asserts.ts";

Deno.test("SPEC systemfonts: can output a collection of system font stacks for prototyping", function () {
  assertEquals(systemfonts("sans-serif"), [
    "-apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
  ]);
  assertEquals(systemfonts("sans-serif", "serif"), [
    "-apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
    "Iowan Old Style, Apple Garamond, Baskerville, Times New Roman, Droid Serif, Times, Source Serif Pro, serif, Apple Color Emoji, Segoe UI Emoji, Segoe UI Symbol",
  ]);
  assertEquals(systemfonts("sans-serif", "serif", "monospace"), [
    "-apple-system, BlinkMacSystemFont, avenir next, avenir, helvetica neue, helvetica, Ubuntu, roboto, noto, segoe ui, arial, sans-serif",
    "Iowan Old Style, Apple Garamond, Baskerville, Times New Roman, Droid Serif, Times, Source Serif Pro, serif, Apple Color Emoji, Segoe UI Emoji, Segoe UI Symbol",
    "Menlo, Consolas, Monaco, Liberation Mono, Lucida Console, monospace",
  ]);
});

Deno.test("EGDE systemfonts: rejects invalid family keys", function () {
  assertThrows(
    () => {
      throw systemfonts("invalid");
    },
    undefined,
    "not a system font stack family",
  );
});
#+END_SRC

**** Typography Results

#+BEGIN_SRC shell
printf '%s\n' (NO_COLOR=true deno test ./typography/index_test.js)
#+END_SRC

#+NAME: typography-test
#+begin_src shell
running 2 tests
test SPEC systemfonts: can output a collection of system font stacks for prototyping ... ok (6ms)
test EGDE systemfonts: rejects invalid family keys ... ok (3ms)

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out (10ms)

#+end_src

** Modular Scale (=scale/index.js=)

Now that I'm all set for color, I can begin thinking about sizing and proportion. Modular scales are
the best way to manage consistency between values. They can be used for:

+ typographical hierarchy
+ spacing
+ sizing
+ borders

The Quarks System Core scale module is more or less unchanged from QuarkSuite 1 with the addition of
error handling to catch bad input.

It begins with creating a scale as a collection of raw values that the remaining utilities consume
and modify before finally attaching units for output.

