src/internals/color/format/hsl.js

// [[file:../../../../README.org::*HSL Extractor][HSL Extractor:1]]
/** Extract: HSL values */
export const extract = (hsl) => hsl.match(/(-?[\d.](%|deg|g?rad|turn)?)+/g);
// HSL Extractor:1 ends here
